# Задача 1. Написать программу, запрашивающую у пользователя ввод числа и
# выводит на экран все числа от 1 до введенного числа

num = int(input("Введите число: "))

for i in range (1, num + 1):
    print (i)

# Задача 2. Написать программу, которая запрашивает у пользователя
# ввод 2 чисел и выводит большее из них на экран

"""
input_num1 = int(input("Введите число 1: "))
input_num2 = int(input("Введите число 2: "))

if input_num1 > input_num2:
    print("Большее число: ", input_num1)
else:
    print("Большее число: ", input_num2)
"""